/**
 ****************************************************************************************************
 * @file        btim.h
 * @author    lis
 * @version     V1.0
 * @date        2024
 * @brief       基本定时器 驱动代码
 * @license     复成医疗

 */

#ifndef __BTIM_H
#define __BTIM_H
#include "./SYSTEM/sys/sys.h"

/******************************************************************************************/
/* 基本定时器 定义 */

/* TIMX 中断定义 
 * 默认是针对TIM6/TIM7
 * 注意: 通过修改这4个宏定义,可以支持TIM1~TIM8任意一个定时器.
 */
 


/******************************************************************************************/
void b_time4_Init(void);

#endif

















